Revit 2027 API
BuiltInFailures.KeynoteTagFailures.NoKeynoteAssignedToLinkedElement Property
 The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoKeynoteAssignedToLinkedElement { get; }
Public Shared ReadOnly Property NoKeynoteAssignedToLinkedElement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoKeynoteAssignedToLinkedElement {
	FailureDefinitionId^ get ();
}
static member NoKeynoteAssignedToLinkedElement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.KeynoteTagFailures Class
Autodesk.Revit.DB Namespace